{"_path":"/projects","_dir":"","_draft":false,"_partial":false,"_locale":"","body":[{"name":"athletic","content":{"side":{"title":"Scaling the product for Athletic Greens","blocks":[{"title":"Role","description":"Design lead, senior product designer"},{"title":"Scope","description":"Product design, design systems, branding"},{"title":"Platform","description":"Web, iOS"}]},"info":{"title":"AG1 by Athletic Greens is a daily nutrition supplement that supports whole body health.","description":"After launching the MVP and confirming the market, it was necessary to build flexible processes scale the product rapidly.","blocks":[{"title":"Background","description":"<p>After launching the product and checking demand, it became necessary to both scale in the United States and explore the European market. <br><br> The existing solution did not allow automating work with customer orders, as well as quickly launching advertising campaigns and testing hypotheses.</p>"},{"title":"Opportunities","description":"<p>Through market research and customer feedback analysis, there were identified several key opportunities for improvement, including enhancing product aesthetics, functionality and user experience to streamline the shopping process, increase conversion rates and retention.</p>"},{"title":"Solution","description":"<p>The first stream of work was devoted to building a systematic work with the brand and design systems. So, a flexible design system was built that incorporated dozens of approaches and patterns and more than 170 updated components. <br><br> Secondly, it was necessary to automate the launch of marketing landing pages and testing. We turned to opinion leaders and created personalized landing pages with our heroes.</p>","picture":"work-img-1.webp"},{"description":"<p>These landers are made using components with tens of variants to customize their look & feel.</p>","picture":"work-img-2.webp"},{"description":"<p>Next, a design system of landing page components was built with the possibility of flexible configuration. All components have been carefully implemented in Sanity, which made it possible to quickly assemble and launch new campaigns and send them for testing.</p>","picture":"work-img-3.webp"},{"description":"<p>After a series of tests and optimizations, we’ve got a fabulous 13.7% subscription purchase conversion rate for these hero landers in average.</p>","picture":"work-img-4.webp"},{"description":"<p>Building a long-term relationship with a client is not only the right promotion of the service. This is the formation of healthy habits. That is why we have brought daily AG1 taking to the mobile devices.</p>","picture":"work-img-5.webp"},{"title":"Impact","description":"<p>The product design yielded significant results, including:</p> <ul><li>A noticeable increase in website traffic, conversion rates, and average order value.</li>          <li>Enhanced customer satisfaction and loyalty, reflected in higher repeat purchase rates and positive reviews.</li>          <li>Improved market positioning and competitive advantage through differentiated product offerings and innovative features.</li>          <li>Recognition within the industry for design excellence and innovation, contributing to brand credibility and visibility.</li></ul>"}]}}}],"_id":"content:projects.json","_type":"json","title":"Projects","_source":"content","_file":"projects.json","_extension":"json"}