{"generatedAt":1719078188077,"generateTime":103,"contents":[{"_path":"/projects","_dir":"","_draft":false,"_partial":false,"_locale":"","body":[{"name":"athletic","content":{"side":{"title":"Scaling the product for Athletic Greens","blocks":[{"title":"Role","description":"Design lead, senior product designer"},{"title":"Scope","description":"Product design, design systems, branding"},{"title":"Platform","description":"Web, iOS"}]},"info":{"title":"AG1 by Athletic Greens is a daily nutrition supplement that supports whole body health.","description":"After launching the MVP and confirming the market, it was necessary to build flexible processes scale the product rapidly.","blocks":[{"title":"Background","description":"<p>After launching the product and checking demand, it became necessary to both scale in the United States and explore the European market.<br><br>The existing solution did not allow automating work with customer orders, as well as quickly launching advertising campaigns and testing hypotheses.</p>"},{"title":"Opportunities","description":"<p>Through market research and customer feedback analysis, there were identified several key opportunities for improvement, including enhancing product aesthetics, functionality and user experience to streamline the shopping process, increase conversion rates and retention.</p>"},{"title":"Solution","description":"<p>The first stream of work was devoted to building a systematic work with the brand and design systems. So, a flexible design system was built that incorporated dozens of approaches and patterns and more than 170 updated components.<br><br>Secondly, it was necessary to automate the launch of marketing landing pages and testing. We turned to opinion leaders and created personalized landing pages with our heroes.</p>","picture":"work1-img-1.webp"},{"description":"<p>These landers are made using components with tens of variants to customize their look & feel.</p>","picture":"work1-img-2.webp"},{"description":"<p>Next, a design system of landing page components was built with the possibility of flexible configuration. All components have been carefully implemented in Sanity, which made it possible to quickly assemble and launch new campaigns and send them for testing.</p>","picture":"work1-img-3.webp"},{"description":"<p>After a series of tests and optimizations, we’ve got a fabulous 13.7% subscription purchase conversion rate for these hero landers in average.</p>","picture":"work1-img-4.webp"},{"description":"<p>Building a long-term relationship with a client is not only the right promotion of the service. This is the formation of healthy habits. That is why we have brought daily AG1 taking to the mobile devices.</p>","picture":"work1-img-5.webp"},{"title":"Impact","description":"<p>Thanks to these changes we’ve got up to 26.8% income growth on seasonal sales of AG1 and up to 7.6% in ARPPU growth (YoY forecast).</p>"}]}}},{"name":"futurebox","content":{"side":{"title":"Building an innovative construction with Futurebox","blocks":[{"title":"Role","description":"Senior product designer"},{"title":"Scope","description":"Product design, design systems, branding"},{"title":"Platform","description":"Web"}]},"info":{"title":"Futurebox is an AI-powered engine for generating 3D visualizations to sell the real estate properties on the construction stage.","description":"After successfully testing the prototype, it needed a stunning new visual appearance.","blocks":[{"title":"Background","description":"<p>If a mathematician and a data scientist meet, an explosive mixture will result. That's how a solution appeared that uses AI to fully automatically build real estate visualizations based on blueprints. <br><br>So customers can take a 3D tour of their apartment, which has not yet been built, choose the interior, lighting and decoration.</p>"},{"title":"Opportunities","description":"<p>The algorithm lacked a user-friendly and effective interface to test the viability of the MVP and the interest of potential customers.</p>"},{"title":"Solution","description":"<p>It was decided to hold a soft launch in Dubai. I started making the app by creating an interactive 3D map of the city, where all the real estate objects are located. The user can find a suitable object, see its location on the map, on the building diagram, and also go to the 3D tour.</p>","picture":"work2-img-1.webp"},{"description":"<p>In addition to the application itself, a landing page builder was also developed, thanks to which it became possible to quickly launch advertising campaigns to increase sales.</p>","picture":"work2-img-2.webp"},{"title":"Impact","description":"<p>After launching and a series of tests and optimizations, MVP confirmed viability with a lead conversion rate of over 5.6%.</p>"}]}}},{"name":"deepanalytics","content":{"side":{"title":"Making better decisions with Deep Analytics","blocks":[{"title":"Role","description":"Senior product designer"},{"title":"Scope","description":"Product design, design systems, branding"},{"title":"Platform","description":"Web"}]},"info":{"title":"Deep Analytics is an AR/VR analytics system for investors in the field of innovative industries.","description":"A large data model requires new dimensions to work with them conveniently.","blocks":[{"title":"Background","description":"<p>Deep Analytics is an analytical agency that collects big data on the most technological industries in the UK. After forming their data model, it became necessary to create a unique analytics system that will allow investors to make decisions using the full power of augmented and virtual reality.</p>"},{"title":"Opportunities","description":"<p>The task of using three dimensions to interact with big data is unique in itself.</p>"},{"title":"Solution","description":"<p>First, a new look was developed for the brand and its advertising pages.</p>","picture":"work3-img-1.webp"},{"description":"<p>As for the application itself, to create an interface that will be convenient and effective to use in three-dimensional space, it took studying the principles and rules of the WebGL and Unity engine.<br><br>The analytics system has received an interface that works in a regular browser. But when virtual reality devices are connected, the application automatically switches to advanced interaction mode with gesture control devices.<br><br>The system interface itself has received a library of three-dimensional data visualizations with an API that allows you to customize the appearance and embed data on web pages.</p>","picture":"work3-img-2.webp"},{"title":"Impact","description":"<p>After the launch and tests, MVP confirmed the interest among investors.</p>"}]}}},{"name":"exynex","content":{"side":{"title":"Uncovering spies with Exynex","blocks":[{"title":"Role","description":"Senior product designer"},{"title":"Scope","description":"Product design, design systems"},{"title":"Platform","description":"Web"}]},"info":{"title":"Exynex allows you to know what your data do websites & apps collect.","description":"After checking the market needs for the product, it became necessary to create a user-friendly interface for the new service.","blocks":[{"title":"Background","description":"<p>The idea of creating a service with which you can study detailed statistics about what data online services collect about their users looks fresh and relevant.</p>"},{"title":"Opportunities","description":"<p>There are solutions on the market that allow you to automate work with tracker data and service restrictions, but they lack a simple and minimalistic interface that will make it easier to work with large amounts of data.</p>"},{"title":"Solution","description":"<p>The service contains a huge database of Internet services for which you can find detailed information: which trackers are used, which permissions are required for correct operation, how reliable the developers are and how high the risks of using these products are.<br><br>All the necessary information can be found using a search based on smart algorithms.</p>","picture":"work4-img-1.webp"},{"description":"<p>Each application has a structured page with detailed data on trackers, permissions, as well as an algorithm-based assessment that shows how safe it is to use the service.</p>","picture":"work4-img-2.webp"},{"title":"Impact","description":"<p>After launching and a series of tests and optimizations, MVP confirmed viability with a YoY traffic growth forecast of 132%.</p>"}]}}},{"name":"edny","content":{"side":{"title":"Building on-the-go education experience with Edny","blocks":[{"title":"Role","description":"Design lead, senior product designer"},{"title":"Scope","description":"Product design, design systems"},{"title":"Platform","description":"iOS"}]},"info":{"title":"Edny is a mobile marketplace of online courses.","description":"Launching the MVP to confirm the unit economy and demand.","blocks":[{"title":"Background","description":"<p>The main idea that the brand promotes is the opportunity to form wherever you are: at home, at work, at school or while walking.</p>"},{"title":"Opportunities","description":"<p>The embodiment of this idea was the mobile application, which is a marketplace for online courses for in-demand professions.</p>"},{"title":"Solution","description":"<p>The product has received a convenient online course feed, where you can find and purchase courses of interest in one place. There is also a convenient search by categories and keywords.<br><br>The main principle is that the platform unites both creators and buyers of online courses in a single information space of the social network.</p>","picture":"work5-img-1.webp"},{"title":"Impact","description":"<p>After the launch of the MVP, demand was confirmed, as well as the unit economy of the service for further scaling.</p>"}]}}},{"name":"vcards","content":{"side":{"title":"Taking control over money with VCards","blocks":[{"title":"Role","description":"Senior product designer"},{"title":"Scope","description":"Product design, design systems"},{"title":"Platform","description":"iOS"}]},"info":{"title":"VCards is a mobile wallet for managing virtual cards.","description":"After checking the market, it was necessary to launch. MVP and start scaling.","blocks":[{"title":"Background","description":"<p>This is a mobile wallet where you can create and manage virtual cards to pay for online purchases.</p>"},{"title":"Opportunities","description":"<p>Using virtual cards to pay for Internet services and online purchases is the safest way to keep your bank data from hacking and leaks. After integration with a financial infrastructure provider, it was necessary to create a convenient client for managing virtual cards.</p>"},{"title":"Solution","description":"<p>The wallet has received a minimalistic design in the human interface guidelines for iOS. The application allows you to create any number of virtual cards for linking to online services. It is also possible to configure the generation of cards for making one-time payments.</p>","picture":"work6-img-1.webp"},{"title":"Impact","description":"<p>After launching the MVP, the company raised $1.2 at Stage A.</p>"}]}}}],"_id":"content:projects.json","_type":"json","title":"Projects","_source":"content","_file":"projects.json","_extension":"json"},{"_path":"/reviews","_dir":"","_draft":false,"_partial":false,"_locale":"","body":[{"text":"We’ve got a really amazing design system.","name":"Nick Boes","from":"Head of design at Athletic Greens"},{"text":"We have reached a new level in how quickly we can launch new products.","name":"Igor Lukyanov","from":"Managing partner at AdGuard"},{"text":"One of the best designers I’ve ever worked with.","name":"Mohammed Gafarov","from":"CEO at Celestial Group"},{"text":"Just a brilliant work.","name":"Kirill Maimistov","from":"CTO at Medaboutme"}],"_id":"content:reviews.json","_type":"json","title":"Reviews","_source":"content","_file":"reviews.json","_extension":"json"},{"_path":"/works","_dir":"","_draft":false,"_partial":false,"_locale":"","body":[{"header":"Athletic Greens","name":"athletic","text":"Original Foundational Nutrition drink to provide daily support where the body needs it most","preview":"preview-1.webp"},{"header":"Futurebox","name":"futurebox","text":"Sell real estate under construction using AR/VR technologies","preview":"preview-2.webp"},{"header":"Deep Analytics","name":"deepanalytics","text":"Make better decisions using the power of more dimensions with innovative AR/VR analytics","preview":"preview-3.webp"},{"header":"Exynex","name":"exynex","text":"Discover what services track your data online","preview":"preview-4.webp"},{"header":"Edny","name":"edny","text":"Mobile marketplace of online courses","preview":"preview-5.webp"},{"header":"VCards","name":"vcards","text":"Mobile wallet for managing your virtual cards","preview":"preview-6.webp"}],"_id":"content:works.json","_type":"json","title":"Works","_source":"content","_file":"works.json","_extension":"json"}],"navigation":[{"title":"Projects","_path":"/projects"},{"title":"Reviews","_path":"/reviews"},{"title":"Works","_path":"/works"}]}